## Titanic Data

In [1]:
import pandas as pd
import numpy as np


df_train = pd.read_csv('train.csv')
df_test = pd.read_csv('test.csv')

In [2]:
#encoding cleaning train-test data

sexMap = {'female': 0, 'male': 1}
df_train['Sex'] = df_train['Sex'].map(sexMap)
df_test['Sex'] = df_test['Sex'].map(sexMap)

In [3]:
embarkedMap = {'C': 0, 'Q': 1, 'S': 2}
df_train['Embarked'] = df_train['Embarked'].map(embarkedMap)
df_test['Embarked'] = df_test['Embarked'].map(embarkedMap)

In [4]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0.0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2.0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2.0

In [5]:
col_drop = ['Name', 'Ticket', 'Cabin']

df_train = df_train.drop(columns=col_drop)
df_test = df_test.drop(columns=col_drop)

In [6]:
df_train.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500       2.0
1            2         1       1    0  38.0      1      0  71.2833       0.0
2            3         1       3    0  26.0      0      0   7.9250       2.0
3            4         1       1    0  35.0      1      0  53.1000       2.0
4            5         0       3    1  35.0      0      0   8.0500       2.0

In [7]:
df_train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [ ]:
#imputing the fir transform train data and transform test data
from sklearn.impute import SimpleImputer

#creating imputers
imputerMean = SimpleImputer(strategy='mean', missing_values=np.nan)
imputerEmbarked = SimpleImputer(strategy='most_frequent', missing_values=np.nan)
imputerFare = SimpleImputer(strategy='most_frequent', missing_values=np.nan)

In [ ]:
#For checking the missing value in test data
df_test['Fare'].unique()

array([  7.8292,   7.    ,   9.6875,   8.6625,  12.2875,   9.225 ,
         7.6292,  29.    ,   7.2292,  24.15  ,   7.8958,  26.    ,
        82.2667,  61.175 ,  27.7208,  12.35  ,   7.225 ,   7.925 ,
        59.4   ,   3.1708,  31.6833,  61.3792, 262.375 ,  14.5   ,
        61.9792,  30.5   ,  21.6792,  31.5   ,  20.575 ,  23.45  ,
        57.75  ,   8.05  ,   9.5   ,  56.4958,  13.4167,  26.55  ,
         7.85  ,  13.    ,  52.5542,  29.7   ,   7.75  ,  76.2917,
        15.9   ,  60.    ,  15.0333,  23.    , 263.    ,  15.5792,
        29.125 ,   7.65  ,  16.1   ,  13.5   ,   7.725 ,  21.    ,
         7.8792,  42.4   ,  28.5375, 211.5   ,  25.7   ,  15.2458,
       221.7792,  10.7083,  14.4542,  13.9   ,   7.775 ,  52.    ,
         7.7958,  78.85  ,   7.8542,  55.4417,   8.5167,  22.525 ,
         7.8208,   8.7125,  15.0458,   7.7792,  31.6792,   7.2833,
         6.4375,  16.7   ,  75.2417,  15.75  ,   7.25  ,  23.25  ,
        28.5   ,  25.4667,  46.9   , 151.55  ,  18.    ,  51.8625,
        83.1583,      nan,  12.1833,  31.3875,   7.55  ,  13.775 ,
         7.7333,  22.025 ,  50.4958,  34.375 ,   8.9625,  39.    ,
        36.75  ,  53.1   , 247.5208,  16.    ,  69.55  ,  32.5   ,
       134.5   ,  10.5   ,   8.1125,  15.5   ,  14.4   , 227.525 ,
        25.7417,   7.05  ,  73.5   ,  42.5   , 164.8667,  13.8583,
        27.4458,  15.1   ,  65.    ,   6.4958,  71.2833,  75.25  ,
       106.425 ,  30.    ,   7.8875,  27.75  , 136.7792,   9.325 ,
        17.4   ,  12.7375,   0.    ,  20.2125,  39.6   ,   6.95  ,
        81.8583,  41.5792,  45.5   ,   9.35  ,  93.5   ,  14.1083,
         7.575 , 135.6333, 146.5208, 211.3375,  79.2   ,  15.7417,
         7.5792, 512.3292,  63.3583,  51.4792,  15.55  ,  37.0042,
        14.4583,  39.6875,  11.5   ,  50.    ,  12.875 ,  21.075 ,
        39.4   ,  20.25  ,  47.1   ,  13.8625,   7.7208,  90.    ,
       108.9   ,  22.3583])